In [0]:
import pandas as pd

---
### **Criando um DataFrame**

In [0]:
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}

df = pd.DataFrame(data)
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

### **Importando um arquivo CSV para um DataFrame**

In [0]:
arquivo = '../content/drive/My Drive/Temp/salarios.csv'
df = pd.read_csv(arquivo)

### **Copiando um DataFrame**

In [0]:
# Útil caso necessite fazer alterações e não queira alterar o original
# "df_2 = df" não funciona. "df" é alterado junto com "df_2"
df_2 = df.copy()

---
### **Tamanho do DataFrame**

In [136]:
print(df.shape)
print('Linhas:', df.shape[0])
print('Colunas:', df.shape[1])

(32182, 4)
Linhas: 32182
Colunas: 4

### **Estrutura do DataFrame**

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32182 entries, 0 to 32181
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32181 non-null  object
 1   Position Title          32181 non-null  object
 2   Department              32181 non-null  object
 3   Employee Annual Salary  32181 non-null  object
dtypes: object(4)
memory usage: 1005.8+ KB

### **Componentes do DataFrame**

In [0]:
df.columns

Index(['Name', 'Position Title', 'Department', 'Employee Annual Salary'], dtype='object')

In [0]:
df.index #Linhas

RangeIndex(start=0, stop=32182, step=1)

In [0]:
df.values

array([['AARON,  ELVIA J', 'WATER RATE TAKER', 'WATER MGMNT',
        '$88965.00'],
       ['AARON,  JEFFERY M', 'POLICE OFFICER', 'POLICE', '$80778.00'],
       ['AARON,  KARINA', 'POLICE OFFICER', 'POLICE', '$80778.00'],
       ...,
       ['ZYRKOWSKI,  CARLO E', 'POLICE OFFICER', 'POLICE', '$86520.00'],
       ['ZYSKOWSKI,  DARIUSZ', 'CHIEF DATA BASE ANALYST', 'DoIT',
        '$110352.00'],
       [nan, nan, nan, nan]], dtype=object)

### **Resumo do conteúdo**

In [0]:
df.head() #5 primeiros registros (.tail() para os 5 últimos)

                  Name  ... Employee Annual Salary
0      AARON,  ELVIA J  ...              $88965.00
1    AARON,  JEFFERY M  ...              $80778.00
2       AARON,  KARINA  ...              $80778.00
3  AARON,  KIMBERLEI R  ...              $84780.00
4  ABAD JR,  VICENTE M  ...             $104736.00

[5 rows x 4 columns]

---
### **Definindo uma coluna como índice**

In [0]:
df.set_index('Name', inplace=True) #"inplace=True" aplica a ação direto no DataFrame original
df.head()

                               Position Title  ... Employee Annual Salary
Name                                           ...
AARON,  ELVIA J              WATER RATE TAKER  ...              $88965.00
AARON,  JEFFERY M              POLICE OFFICER  ...              $80778.00
AARON,  KARINA                 POLICE OFFICER  ...              $80778.00
AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  ...              $84780.00
ABAD JR,  VICENTE M         CIVIL ENGINEER IV  ...             $104736.00

[5 rows x 3 columns]

In [0]:
# Voltando ao original
df.reset_index(inplace=True)
df.head()

                  Name  ... Employee Annual Salary
0      AARON,  ELVIA J  ...              $88965.00
1    AARON,  JEFFERY M  ...              $80778.00
2       AARON,  KARINA  ...              $80778.00
3  AARON,  KIMBERLEI R  ...              $84780.00
4  ABAD JR,  VICENTE M  ...             $104736.00

[5 rows x 4 columns]

---
### **Ordenando**

In [0]:
df.sort_values('Department')

                          Name  ... Employee Annual Salary
26145  SEPULVEDA CORY,  LORI J  ...              $60780.00
30552        WEINERT,  DARCI N  ...              $66696.00
26429      SHORTER,  TERESSA J  ...              $69888.00
18641     MC SWAIN,  MICHELE A  ...              $91980.00
9805        GAVIN,  MARGARET H  ...              $77280.00
...                        ...  ...                    ...
26445        SHRADER,  TIMOTHY  ...              $97968.00
26468   SIDDIQUI,  ABDURRAZZAQ  ...              $87912.00
7444         DREGER,  THOMAS J  ...              $93745.60
0              AARON,  ELVIA J  ...              $88965.00
32181                      NaN  ...                    NaN

[32182 rows x 4 columns]

In [0]:
df.sort_values('Department', ascending=False)

                       Name  ... Employee Annual Salary
0           AARON,  ELVIA J  ...              $88965.00
7273    DONOVAN,  TIMOTHY E  ...              $91520.00
10966    GUERRERO,  CYNTHIA  ...              $60408.00
7272       DONOVAN,  THOMAS  ...              $91520.00
2092      BIGECK,  RONALD T  ...              $79040.00
...                     ...  ...                    ...
11895      HEIDT,  SANDRA E  ...              $93432.00
14068        JONES,  LOIS M  ...              $60780.00
26979      SMITH,  PAMELA M  ...              $88812.00
4236   CASSELLA,  CATHERINE  ...              $60780.00
32181                   NaN  ...                    NaN

[32182 rows x 4 columns]

In [0]:
df.sort_values(['Department','Position Title','Name'], ascending=[True, True, False])

                          Name  ... Employee Annual Salary
31532   WOODRIDGE,  RACHENETTE  ...              $58020.00
28189          TADEO,  ALITA F  ...              $58020.00
26603        SIMPSON,  KAREN E  ...              $58020.00
26145  SEPULVEDA CORY,  LORI J  ...              $60780.00
25634        SANTIAGO,  NELIDA  ...              $55428.00
...                        ...  ...                    ...
3454             BURT,  CARL S  ...              $88968.00
3138          BROWN,  SHARON L  ...              $81108.00
2401          BOLTON,  BRIAN E  ...              $77400.00
0              AARON,  ELVIA J  ...              $88965.00
32181                      NaN  ...                    NaN

[32182 rows x 4 columns]

---
### **Selecionando colunas**
Colunas sem espaços ou caracteres especiais podem ser selecionadas diretamente com a notação de "ponto".

Caso contrário, devem ser passadas como String dentro de [ ].

In [0]:
df.Name

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32177     ZYGOWICZ,  PETER J
32178      ZYMANTAS,  MARK E
32179    ZYRKOWSKI,  CARLO E
32180    ZYSKOWSKI,  DARIUSZ
32181                    NaN
Name: Name, Length: 32182, dtype: object

In [0]:
df['Name']

0            AARON,  ELVIA J
1          AARON,  JEFFERY M
2             AARON,  KARINA
3        AARON,  KIMBERLEI R
4        ABAD JR,  VICENTE M
                ...
32177     ZYGOWICZ,  PETER J
32178      ZYMANTAS,  MARK E
32179    ZYRKOWSKI,  CARLO E
32180    ZYSKOWSKI,  DARIUSZ
32181                    NaN
Name: Name, Length: 32182, dtype: object

In [0]:
df['Position Title']

0                WATER RATE TAKER
1                  POLICE OFFICER
2                  POLICE OFFICER
3        CHIEF CONTRACT EXPEDITER
4               CIVIL ENGINEER IV
                   ...
32177              POLICE OFFICER
32178              POLICE OFFICER
32179              POLICE OFFICER
32180     CHIEF DATA BASE ANALYST
32181                         NaN
Name: Position Title, Length: 32182, dtype: object

In [0]:
# Múltiplas colunas devem ser passadas como uma Lista e podem ser em qualquer ordem
df[['Department','Position Title']]

             Department            Position Title
0           WATER MGMNT          WATER RATE TAKER
1                POLICE            POLICE OFFICER
2                POLICE            POLICE OFFICER
3      GENERAL SERVICES  CHIEF CONTRACT EXPEDITER
4           WATER MGMNT         CIVIL ENGINEER IV
...                 ...                       ...
32177            POLICE            POLICE OFFICER
32178            POLICE            POLICE OFFICER
32179            POLICE            POLICE OFFICER
32180              DoIT   CHIEF DATA BASE ANALYST
32181               NaN                       NaN

[32182 rows x 2 columns]

---
### **Filtrando**

In [137]:
# Filtrando diretamente uma coluna, obtém-se um DataFrame booleano com a resposta para cada linha
filtro = df['Department']=='POLICE'
filtro

0        False
1         True
2         True
3        False
4        False
         ...
32177     True
32178     True
32179     True
32180    False
32181    False
Name: Department, Length: 32182, dtype: bool

In [138]:
# Aplicando esse DataFrame ao original, temos o resultado filtrado
df[filtro]

                      Name  Position Title Department Employee Annual Salary
1        AARON,  JEFFERY M  POLICE OFFICER     POLICE              $80778.00
2           AARON,  KARINA  POLICE OFFICER     POLICE              $80778.00
9         ABBATE,  TERRY M  POLICE OFFICER     POLICE              $86520.00
11       ABBOTT,  LYNISE M       CLERK III     POLICE              $43920.00
13         ABDALLAH,  ZAID  POLICE OFFICER     POLICE              $69684.00
...                    ...             ...        ...                    ...
32172     ZWIT,  JEFFREY J  POLICE OFFICER     POLICE              $83616.00
32174        ZYDEK,  BRYAN  POLICE OFFICER     POLICE              $80778.00
32177   ZYGOWICZ,  PETER J  POLICE OFFICER     POLICE              $86520.00
32178    ZYMANTAS,  MARK E  POLICE OFFICER     POLICE              $83616.00
32179  ZYRKOWSKI,  CARLO E  POLICE OFFICER     POLICE              $86520.00

[13570 rows x 4 columns]

In [0]:
# Pode-se também passar o filtro diretamente
df[df['Position Title']=='POLICE OFFICER']

                        Name  Position Title Department Employee Annual Salary
1          AARON,  JEFFERY M  POLICE OFFICER     POLICE              $80778.00
2             AARON,  KARINA  POLICE OFFICER     POLICE              $80778.00
9           ABBATE,  TERRY M  POLICE OFFICER     POLICE              $86520.00
13           ABDALLAH,  ZAID  POLICE OFFICER     POLICE              $69684.00
14     ABDELHADI,  ABDALMAHD  POLICE OFFICER     POLICE              $80778.00
...                      ...             ...        ...                    ...
32172       ZWIT,  JEFFREY J  POLICE OFFICER     POLICE              $83616.00
32174          ZYDEK,  BRYAN  POLICE OFFICER     POLICE              $80778.00
32177     ZYGOWICZ,  PETER J  POLICE OFFICER     POLICE              $86520.00
32178      ZYMANTAS,  MARK E  POLICE OFFICER     POLICE              $83616.00
32179    ZYRKOWSKI,  CARLO E  POLICE OFFICER     POLICE              $86520.00

[9489 rows x 4 columns]

In [0]:
# Múltiplos filtros
df[(df['Department']=='POLICE') & (df['Position Title']!='POLICE OFFICER')]

                         Name  ... Employee Annual Salary
11          ABBOTT,  LYNISE M  ...              $43920.00
21       ABDULLAH,  LAKENYA N  ...              $16692.00
51       ABUZANAT,  ABDALLA H  ...              $90846.00
74          ACEVEDO,  MARCO A  ...              $93648.00
86           ACKLIN,  QIANA D  ...              $16692.00
...                       ...  ...                    ...
32076       ZIELINSKI,  TECLA  ...              $22131.20
32115         ZODO,  NICOLA E  ...             $103590.00
32134       ZUBER,  MICHAEL R  ...              $97044.00
32161      ZURAWSKI,  CAROL A  ...              $21080.80
32169  ZWARYCZ MANN,  IRENE A  ...              $16692.00

[4081 rows x 4 columns]

In [0]:
# Usando filtro externo: .isin()
filtro = ['SERGEANT','CROSSING GUARD','CLERK III']
df[df['Position Title'].isin(filtro)]

                            Name  ... Employee Annual Salary
11             ABBOTT,  LYNISE M  ...              $43920.00
21          ABDULLAH,  LAKENYA N  ...              $16692.00
86              ACKLIN,  QIANA D  ...              $16692.00
113            ADAMS EL,  WARREN  ...              $18324.80
156                ADE,  JAMES P  ...             $110370.00
...                          ...  ...                    ...
32065  ZIC SCHLOMAS,  VIRGINIA M  ...             $110370.00
32076          ZIELINSKI,  TECLA  ...              $22131.20
32115            ZODO,  NICOLA E  ...             $103590.00
32161         ZURAWSKI,  CAROL A  ...              $21080.80
32169     ZWARYCZ MANN,  IRENE A  ...              $16692.00

[1832 rows x 4 columns]

---
### **Filtrando com `.loc`**
`.loc` faz o filtro do DataFrame atravé de slice por linhas(index) e/ou colunas

`.loc[lin_ini:lin_fim , col_ini:col_fim]`

In [149]:
# Slice só por linhas
df.loc[20:23]

                    Name  ... Employee Annual Salary
20      ABDULLAH,  KEVIN  ...             $110370.00
21  ABDULLAH,  LAKENYA N  ...              $16692.00
22   ABDULLAH,  RASHAD J  ...              $91520.00
23  ABDUL-SHAKUR,  TAHIR  ...              $40560.00

[4 rows x 4 columns]

In [155]:
# Slice só por colunas
df.loc[ : , 'Name':'Department']

                      Name            Position Title        Department
0          AARON,  ELVIA J          WATER RATE TAKER       WATER MGMNT
1        AARON,  JEFFERY M            POLICE OFFICER            POLICE
2           AARON,  KARINA            POLICE OFFICER            POLICE
3      AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  GENERAL SERVICES
4      ABAD JR,  VICENTE M         CIVIL ENGINEER IV       WATER MGMNT
...                    ...                       ...               ...
32177   ZYGOWICZ,  PETER J            POLICE OFFICER            POLICE
32178    ZYMANTAS,  MARK E            POLICE OFFICER            POLICE
32179  ZYRKOWSKI,  CARLO E            POLICE OFFICER            POLICE
32180  ZYSKOWSKI,  DARIUSZ   CHIEF DATA BASE ANALYST              DoIT
32181                  NaN                       NaN               NaN

[32182 rows x 3 columns]

In [181]:
# Slice só por linhas e colunas
df.loc[20:23 , 'Name':'Department']

                    Name  ...        Department
20      ABDULLAH,  KEVIN  ...              FIRE
21  ABDULLAH,  LAKENYA N  ...            POLICE
22   ABDULLAH,  RASHAD J  ...  GENERAL SERVICES
23  ABDUL-SHAKUR,  TAHIR  ...     STREETS & SAN

[4 rows x 3 columns]

**O ideal é que se use uma coluna como índice.**

**A mesma deve ser ordenada nesse caso.**

In [182]:
df_loc = df.set_index('Department').sort_index()
df_loc.head()

                                 Name  ... Employee Annual Salary
Department                             ...
ADMIN HEARNG  SEPULVEDA CORY,  LORI J  ...              $60780.00
ADMIN HEARNG        WEINERT,  DARCI N  ...              $66696.00
ADMIN HEARNG      SHORTER,  TERESSA J  ...              $69888.00
ADMIN HEARNG     MC SWAIN,  MICHELE A  ...              $91980.00
ADMIN HEARNG       GAVIN,  MARGARET H  ...              $77280.00

[5 rows x 3 columns]

In [183]:
df_loc.loc['GENERAL SERVICES':'POLICE' , 'Name':'Position Title' ]

                               Name                          Position Title
Department
GENERAL SERVICES   GOMEZ,  RAFAEL C                        GARAGE ATTENDANT
GENERAL SERVICES   CORDOVA,  JOSE E             REPROGRAPHICS TECHNICIAN II
GENERAL SERVICES     RIVERA,  JAIME        MOTOR TRUCK DRIVER - TIRE REPAIR
GENERAL SERVICES   LADING,  RUDOLPH                                 PAINTER
GENERAL SERVICES  MOSLEY,  REGINALD              OPERATING ENGINEER-GROUP A
...                             ...                                     ...
POLICE                HUERTA,  PAUL                          POLICE OFFICER
POLICE             MANCHA,  RICARDO                              LIEUTENANT
POLICE             MANGAN,  JAMES P                          POLICE OFFICER
POLICE              HUERTA,  JOSE M                          POLICE OFFICER
POLICE            ADAMS,  MICHAEL A  POLICE OFFICER (ASSIGNED AS DETECTIVE)

[16925 rows x 2 columns]

---
### **Adicionando colunas**

In [0]:
# Usaremos a cópia para não alterar o original
df_2.head()

                  Name  ... Employee Annual Salary
0      AARON,  ELVIA J  ...              $88965.00
1    AARON,  JEFFERY M  ...              $80778.00
2       AARON,  KARINA  ...              $80778.00
3  AARON,  KIMBERLEI R  ...              $84780.00
4  ABAD JR,  VICENTE M  ...             $104736.00

[5 rows x 4 columns]

In [0]:
col = df_2['Employee Annual Salary'].str.replace('$','').astype(float) #converte em número
df_2['Annual Salary'] = col
df_2.head()

                  Name  ... Annual Salary
0      AARON,  ELVIA J  ...       88965.0
1    AARON,  JEFFERY M  ...       80778.0
2       AARON,  KARINA  ...       80778.0
3  AARON,  KIMBERLEI R  ...       84780.0
4  ABAD JR,  VICENTE M  ...      104736.0

[5 rows x 5 columns]

In [0]:
df_2['Monthly Salary'] = round(df_2['Annual Salary']/12, 2)
df_2['Daily Salary'] = round(df_2['Annual Salary']/365, 2)
df_2['test'] = 12345
df_2.head()

                  Name            Position Title  ... Daily Salary   test
0      AARON,  ELVIA J          WATER RATE TAKER  ...       243.74  12345
1    AARON,  JEFFERY M            POLICE OFFICER  ...       221.31  12345
2       AARON,  KARINA            POLICE OFFICER  ...       221.31  12345
3  AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  ...       232.27  12345
4  ABAD JR,  VICENTE M         CIVIL ENGINEER IV  ...       286.95  12345

[5 rows x 8 columns]

### **Removendo colunas**

In [0]:
# axis=0 (linhas)
# axis=1 (colunas)
df_2.drop(['Employee Annual Salary','test'], axis=1, inplace=True)
df_2.head()

                  Name            Position Title  ... Monthly Salary  Daily Salary
0      AARON,  ELVIA J          WATER RATE TAKER  ...        7413.75        243.74
1    AARON,  JEFFERY M            POLICE OFFICER  ...        6731.50        221.31
2       AARON,  KARINA            POLICE OFFICER  ...        6731.50        221.31
3  AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  ...        7065.00        232.27
4  ABAD JR,  VICENTE M         CIVIL ENGINEER IV  ...        8728.00        286.95

[5 rows x 6 columns]

### **Renomeando colunas**

In [0]:
df_2.rename(columns={"Name": "Full Name"}, inplace=True) #Serve para múltiplas colunas
df_2.head()

             Full Name            Position Title  ... Monthly Salary  Daily Salary
0      AARON,  ELVIA J          WATER RATE TAKER  ...        7413.75        243.74
1    AARON,  JEFFERY M            POLICE OFFICER  ...        6731.50        221.31
2       AARON,  KARINA            POLICE OFFICER  ...        6731.50        221.31
3  AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  ...        7065.00        232.27
4  ABAD JR,  VICENTE M         CIVIL ENGINEER IV  ...        8728.00        286.95

[5 rows x 6 columns]

---
### **Exportando um DataFrame para um arquivo CSV**

In [0]:
df_2.to_csv('../content/drive/My Drive/Temp/salarios2.csv', index=False, encoding='utf-8')

---
### **Gerando um subconjunto (subset)**
Listar os funcionários do Departamento de Polícia com salário anual acima de 180 mil.

Mostrar: nome, cargo e salário anual(ordenado pelo maior valor).

In [0]:
police_180k = df_2[(df_2['Department']=='POLICE') & (df_2['Annual Salary']>180000)]
police_180k = police_180k.sort_values('Annual Salary', ascending=False)
police_180k = police_180k[['Full Name','Position Title','Annual Salary']]
police_180k

                 Full Name               Position Title  Annual Salary
18039  MC CARTHY,  GARRY F     SUPERINTENDENT OF POLICE       260004.0
31711   WYSINGER,  ALFONZA  FIRST DEPUTY SUPERINTENDENT       197736.0
29025     TRACY,  ROBERT J                        CHIEF       194256.0
8065    ESCALANTE,  JOHN J                        CHIEF       185364.0
11019  GULLIFORD,  WAYNE M                        CHIEF       185364.0
23935   RICCIO,  ANTHONY J                        CHIEF       185364.0
24183      RIVERA,  JUAN J                        CHIEF       185364.0
31019  WILLIAMS,  EUGENE E                        CHIEF       185364.0